XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/Keil.SN32F7_DFP.pdsc
<?xml version="1.0" encoding="UTF-8"?>

<package schemaVersion="1.2" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="PACK.xsd">
  <vendor>Keil</vendor>
  <url>https://www.keil.com/pack/</url>
  <name>SN32F7_DFP</name>
  <description>SONiX SN32F7 Series Device Support and Examples</description>

  <releases>
    <release version="1.0.2" date="2023-09-04" deprecated="2023-09-04">
      This Software Pack is no longer maintained. Please contact the device vendor for support.
	</release>
    <release version="1.0.1">
      File name consistency.
    </release>
    <release version="1.0.0">
      First Release version of SN32F7 Device Family Pack.
    </release>
  </releases>

  <keywords>
    <!-- keywords for indexing -->
    <keyword>SONiX</keyword>
    <keyword>Device Support</keyword>
    <keyword>Device Family Package SONiX</keyword>
    <keyword>SN32F7</keyword>
    <keyword>SN32</keyword>
  </keywords>

  <devices>
    <!-- generated, do not modify this section! -->

    <family Dfamily="SN32F7 Series" Dvendor="SONiX:110">
      <processor Dcore="Cortex-M0" DcoreVersion="r0p0" Dfpu="0" Dmpu="0" Dendian="Little-endian"/>
      <book    name="Documents\dui0497a_cortex_m0_r0p0_generic_ug.pdf" title="Cortex-M0 Generic User Guide"/>
        <description>
SN32F7 series 32-bit micro-controller is a new series of extremely Low Power Consumption and High Performance MCU powered by ARM Cortex M0 processor with Flash ROM architecture.
        </description>

        <feature type="ExtInt"        n="4"/>
        <feature type="Other"         n="1"                           name="Boot Loader"/>
        <feature type="USART"         n="1"/>
        <feature type="I2C"           n="1"/>
        <feature type="I2S"           n="1"/>
        <feature type="RTC"           n="1"/>
        <feature type="Other"         n="1"                           name="HW divider"/>
        <feature type="VCC"           n="1.80"    m="3.60"/>


      <!-- ************************  Subfamily 'SN32F700'  **************************** -->
      <subFamily DsubFamily="SN32F700">
        <feature type="Timer"         n="2"       m="32"/>
      
      <!-- *************************  Device 'SN32F705J'  ***************************** -->
      <device Dname="SN32F705J">
        <processor Dclock="50000000"/>
        <compile header="Device\Include\SN32F700.h"  define="SN32F700"/>
        <debug      svd="SVD\SN32F700.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x8000"     startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x2000"     init   ="0"   default="1"/>
        <algorithm  name="Flash\SN32F700_32.FLM"    start="0x00000000"  size="0x8000"                   default="1"/>
        <book    name="Documents\SN32F705_V2.1R_UM.pdf"                     title="SN32F700/710/720 Series User Manual"/>
        <feature type="IOs"           n="27"/>
        <feature type="ADC"           n="5"       m="12"/>
        <feature type="Timer"         n="1"       m="16"/>
        <feature type="PWM"           n="11"/>
        <feature type="QFN"           n="33"/>
      </device>
      
      <!-- *************************  Device 'SN32F706J'  ***************************** -->
      <device Dname="SN32F706J">
        <processor Dclock="50000000"/>
        <compile header="Device\Include\SN32F700.h"  define="SN32F700"/>
        <debug      svd="SVD\SN32F700.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x8000"     startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x2000"     init   ="0"   default="1"/>
        <algorithm  name="Flash\SN32F700_32.FLM"    start="0x00000000"  size="0x8000"                   default="1"/>
        <book    name="Documents\SN32F705_V2.1R_UM.pdf"                     title="SN32F700/710/720 Series User Manual"/>
        <feature type="IOs"           n="41"/>
        <feature type="ADC"           n="10"      m="12"/>
        <feature type="Timer"         n="2"       m="16"/>
        <feature type="PWM"           n="13"/>
        <feature type="QFN"           n="46"/>
      </device>
      
      <!-- *************************  Device 'SN32F707F'  ***************************** -->
      <device Dname="SN32F707F">
        <processor Dclock="50000000"/>
        <compile header="Device\Include\SN32F700.h"  define="SN32F700"/>
        <debug      svd="SVD\SN32F700.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x8000"     startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x2000"     init   ="0"   default="1"/>
        <algorithm  name="Flash\SN32F700_32.FLM"    start="0x00000000"  size="0x8000"                   default="1"/>
        <book    name="Documents\SN32F705_V2.1R_UM.pdf"                     title="SN32F700/710/720 Series User Manual"/>
        <feature type="IOs"           n="43"/>
        <feature type="ADC"           n="10"      m="12"/>
        <feature type="Timer"         n="2"       m="16"/>
        <feature type="PWM"           n="13"/>
        <feature type="QFP"           n="48"/>
      </device>
      </subFamily>

      <!-- ************************  Subfamily 'SN32F710'  **************************** -->
      <subFamily DsubFamily="SN32F710">
        <feature type="Timer"         n="2"       m="32"/>
      
      <!-- *************************  Device 'SN32F715J'  ***************************** -->
      <device Dname="SN32F715J">
        <processor Dclock="50000000"/>
        <compile header="Device\Include\SN32F710.h"  define="SN32F710"/>
        <debug      svd="SVD\SN32F710.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x4000"     startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x1000"     init   ="0"   default="1"/>
        <algorithm  name="Flash\SN32F710_16.FLM"    start="0x00000000"  size="0x4000"                   default="1"/>
        <book    name="Documents\SN32F705_V2.1R_UM.pdf"                     title="SN32F700/710/720 Series User Manual"/>
        <feature type="IOs"           n="27"/>
        <feature type="ADC"           n="5"       m="12"/>
        <feature type="Timer"         n="1"       m="16"/>
        <feature type="PWM"           n="11"/>
        <feature type="QFN"           n="33"/>
      </device>
      
