XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/Keil.SN32F7_DFP.pdsc
      <!-- *************************  Device 'SN32F716J'  ***************************** -->
      <device Dname="SN32F716J">
        <processor Dclock="50000000"/>
        <compile header="Device\Include\SN32F710.h"  define="SN32F710"/>
        <debug      svd="SVD\SN32F710.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x4000"     startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x1000"     init   ="0"   default="1"/>
        <algorithm  name="Flash\SN32F710_16.FLM"    start="0x00000000"  size="0x4000"                   default="1"/>
        <book    name="Documents\SN32F705_V2.1R_UM.pdf"                     title="SN32F700/710/720 Series User Manual"/>
        <feature type="IOs"           n="41"/>
        <feature type="ADC"           n="10"      m="12"/>
        <feature type="Timer"         n="2"       m="16"/>
        <feature type="PWM"           n="13"/>
        <feature type="QFN"           n="46"/>
      </device>
      
      <!-- *************************  Device 'SN32F717F'  ***************************** -->
      <device Dname="SN32F717F">
        <processor Dclock="50000000"/>
        <compile header="Device\Include\SN32F710.h"  define="SN32F710"/>
        <debug      svd="SVD\SN32F710.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x4000"     startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x1000"     init   ="0"   default="1"/>
        <algorithm  name="Flash\SN32F710_16.FLM"    start="0x00000000"  size="0x4000"                   default="1"/>
        <book    name="Documents\SN32F705_V2.1R_UM.pdf"                     title="SN32F700/710/720 Series User Manual"/>
        <feature type="IOs"           n="43"/>
        <feature type="ADC"           n="10"      m="12"/>
        <feature type="Timer"         n="2"       m="16"/>
        <feature type="PWM"           n="13"/>
        <feature type="QFP"           n="48"/>
      </device>
      </subFamily>

      <!-- ************************  Subfamily 'SN32F720'  **************************** -->
      <subFamily DsubFamily="SN32F720">
        <feature type="Timer"         n="2"       m="16"/>
        <feature type="Timer"         n="2"       m="32"/>
      
      <!-- *************************  Device 'SN32F725J'  ***************************** -->
      <device Dname="SN32F725J">
        <processor Dclock="50000000"/>
        <compile header="Device\Include\SN32F720.h"  define="SN32F720"/>
        <debug      svd="SVD\SN32F720.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x2000"     startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x0800"     init   ="0"   default="1"/>
        <algorithm  name="Flash\SN32F720_8.FLM"     start="0x00000000"  size="0x2000"                   default="1"/>
        <book    name="Documents\SN32F705_V2.1R_UM.pdf"                     title="SN32F700/710/720 Series User Manual"/>
        <feature type="IOs"           n="27"/>
        <feature type="ADC"           n="5"       m="12"/>
        <feature type="PWM"           n="11"/>
        <feature type="QFN"           n="33"/>
      </device>
      
      <!-- *************************  Device 'SN32F726J'  ***************************** -->
      <device Dname="SN32F726J">
        <processor Dclock="50000000"/>
        <compile header="Device\Include\SN32F720.h"  define="SN32F720"/>
        <debug      svd="SVD\SN32F720.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x2000"     startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x0800"     init   ="0"   default="1"/>
        <algorithm  name="Flash\SN32F720_8.FLM"     start="0x00000000"  size="0x2000"                   default="1"/>
        <book    name="Documents\SN32F705_V2.1R_UM.pdf"                     title="SN32F700/710/720 Series User Manual"/>
        <feature type="IOs"           n="41"/>
        <feature type="ADC"           n="10"      m="12"/>
        <feature type="PWM"           n="13"/>
        <feature type="QFN"           n="46"/>
      </device>
      
      <!-- *************************  Device 'SN32F727F'  ***************************** -->
      <device Dname="SN32F727F">
        <processor Dclock="50000000"/>
        <compile header="Device\Include\SN32F720.h"  define="SN32F720"/>
        <debug      svd="SVD\SN32F720.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x2000"     startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x0800"     init   ="0"   default="1"/>
        <algorithm  name="Flash\SN32F720_8.FLM"     start="0x00000000"  size="0x2000"                   default="1"/>
        <book    name="Documents\SN32F705_V2.1R_UM.pdf"                     title="SN32F700/710/720 Series User Manual"/>
        <feature type="IOs"           n="43"/>
        <feature type="ADC"           n="10"      m="12"/>
        <feature type="PWM"           n="13"/>
        <feature type="QFP"           n="48"/>
      </device>
      </subFamily>

      <!-- ************************  Subfamily 'SN32F730'  **************************** -->
      <subFamily DsubFamily="SN32F730">
        <feature type="Timer"         n="3"       m="16"/>
        <feature type="Timer"         n="3"       m="32"/>
        <feature type="PWM"           n="21"/>
      
      <!-- *************************  Device 'SN32F735J'  ***************************** -->
      <device Dname="SN32F735J">
        <processor Dclock="50000000"/>
        <compile header="Device\Include\SN32F760.h"  define="SN32F730"/>
        <debug      svd="SVD\SN32F760.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x2000"     startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x0400"     init   ="0"   default="1"/>
        <algorithm  name="Flash\SN32F730_8.FLM"     start="0x00000000"  size="0x2000"                   default="1"/>
        <book    name="Documents\SN32F760_V1.0R_UM.pdf"                     title="SN32F760/750/740/730 Series User Manual"/>
        <feature type="IOs"           n="26"/>
        <feature type="ADC"           n="4"       m="12"/>
        <feature type="QFN"           n="33"/>
      </device>
      
      <!-- *************************  Device 'SN32F736J'  ***************************** -->
      <device Dname="SN32F736J">
        <processor Dclock="50000000"/>
        <compile header="Device\Include\SN32F760.h"  define="SN32F730"/>
        <debug      svd="SVD\SN32F760.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x2000"     startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x0400"     init   ="0"   default="1"/>
        <algorithm  name="Flash\SN32F730_8.FLM"     start="0x00000000"  size="0x2000"                   default="1"/>
        <book    name="Documents\SN32F760_V1.0R_UM.pdf"                     title="SN32F760/750/740/730 Series User Manual"/>
        <feature type="IOs"           n="40"/>
        <feature type="ADC"           n="7"       m="12"/>
        <feature type="LCD"           n="17"      m="4"/>
        <feature type="QFN"           n="46"/>
      </device>
      
      <!-- *************************  Device 'SN32F737F'  ***************************** -->
      <device Dname="SN32F737F">
        <processor Dclock="50000000"/>
        <compile header="Device\Include\SN32F760.h"  define="SN32F730"/>
        <debug      svd="SVD\SN32F760.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x2000"     startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x0400"     init   ="0"   default="1"/>
        <algorithm  name="Flash\SN32F730_8.FLM"     start="0x00000000"  size="0x2000"                   default="1"/>
        <book    name="Documents\SN32F760_V1.0R_UM.pdf"                     title="SN32F760/750/740/730 Series User Manual"/>
        <feature type="IOs"           n="42"/>
        <feature type="ADC"           n="8"       m="12"/>
        <feature type="LCD"           n="18"      m="4"/>
        <feature type="QFP"           n="48"/>
      </device>
      </subFamily>

      <!-- ************************  Subfamily 'SN32F740'  **************************** -->
      <subFamily DsubFamily="SN32F740">
        <feature type="Timer"         n="3"       m="16"/>
        <feature type="Timer"         n="3"       m="32"/>
        <feature type="PWM"           n="21"/>
      
      <!-- *************************  Device 'SN32F745J'  ***************************** -->
      <device Dname="SN32F745J">
        <processor Dclock="50000000"/>
        <compile header="Device\Include\SN32F760.h"  define="SN32F740"/>
        <debug      svd="SVD\SN32F760.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x4000"     startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x0800"     init   ="0"   default="1"/>
        <algorithm  name="Flash\SN32F740_16.FLM"    start="0x00000000"  size="0x4000"                   default="1"/>
        <book    name="Documents\SN32F760_V1.0R_UM.pdf"                     title="SN32F760/750/740/730 Series User Manual"/>
        <feature type="IOs"           n="26"/>
        <feature type="ADC"           n="4"       m="12"/>
        <feature type="QFN"           n="33"/>
      </device>
      
