XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/Keil.SN32F7_DFP.pdsc
      <!-- *************************  Device 'SN32F746J'  ***************************** -->
      <device Dname="SN32F746J">
        <processor Dclock="50000000"/>
        <compile header="Device\Include\SN32F760.h"  define="SN32F740"/>
        <debug      svd="SVD\SN32F760.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x4000"     startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x0800"     init   ="0"   default="1"/>
        <algorithm  name="Flash\SN32F740_16.FLM"    start="0x00000000"  size="0x4000"                   default="1"/>
        <book    name="Documents\SN32F760_V1.0R_UM.pdf"                     title="SN32F760/750/740/730 Series User Manual"/>
        <feature type="IOs"           n="40"/>
        <feature type="ADC"           n="7"       m="12"/>
        <feature type="LCD"           n="17"      m="4"/>
        <feature type="QFN"           n="46"/>
      </device>
      
      <!-- *************************  Device 'SN32F747F'  ***************************** -->
      <device Dname="SN32F747F">
        <processor Dclock="50000000"/>
        <compile header="Device\Include\SN32F760.h"  define="SN32F740"/>
        <debug      svd="SVD\SN32F760.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x4000"     startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x0800"     init   ="0"   default="1"/>
        <algorithm  name="Flash\SN32F740_16.FLM"    start="0x00000000"  size="0x4000"                   default="1"/>
        <book    name="Documents\SN32F760_V1.0R_UM.pdf"                     title="SN32F760/750/740/730 Series User Manual"/>
        <feature type="IOs"           n="42"/>
        <feature type="ADC"           n="8"       m="12"/>
        <feature type="LCD"           n="18"      m="4"/>
        <feature type="QFP"           n="48"/>
      </device>
      </subFamily>

      <!-- ************************  Subfamily 'SN32F750'  **************************** -->
      <subFamily DsubFamily="SN32F750">
        <feature type="Timer"         n="3"       m="16"/>
        <feature type="Timer"         n="3"       m="32"/>
        <feature type="PWM"           n="21"/>
      
      <!-- *************************  Device 'SN32F755J'  ***************************** -->
      <device Dname="SN32F755J">
        <processor Dclock="50000000"/>
        <compile header="Device\Include\SN32F760.h"  define="SN32F750"/>
        <debug      svd="SVD\SN32F760.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x8000"     startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x1000"     init   ="0"   default="1"/>
        <algorithm  name="Flash\SN32F750_32.FLM"    start="0x00000000"  size="0x8000"                   default="1"/>
        <book    name="Documents\SN32F760_V1.0R_UM.pdf"                     title="SN32F760/750/740/730 Series User Manual"/>
        <feature type="IOs"           n="26"/>
        <feature type="ADC"           n="4"       m="12"/>
        <feature type="QFN"           n="33"/>
      </device>
      
      <!-- *************************  Device 'SN32F756J'  ***************************** -->
      <device Dname="SN32F756J">
        <processor Dclock="50000000"/>
        <compile header="Device\Include\SN32F760.h"  define="SN32F750"/>
        <debug      svd="SVD\SN32F760.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x8000"     startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x1000"     init   ="0"   default="1"/>
        <algorithm  name="Flash\SN32F750_32.FLM"    start="0x00000000"  size="0x8000"                   default="1"/>
        <book    name="Documents\SN32F760_V1.0R_UM.pdf"                     title="SN32F760/750/740/730 Series User Manual"/>
        <feature type="IOs"           n="40"/>
        <feature type="ADC"           n="7"       m="12"/>
        <feature type="LCD"           n="17"      m="4"/>
        <feature type="QFN"           n="46"/>
      </device>
      
      <!-- *************************  Device 'SN32F757F'  ***************************** -->
      <device Dname="SN32F757F">
        <processor Dclock="50000000"/>
        <compile header="Device\Include\SN32F760.h"  define="SN32F750"/>
        <debug      svd="SVD\SN32F760.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x8000"     startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x1000"     init   ="0"   default="1"/>
        <algorithm  name="Flash\SN32F750_32.FLM"    start="0x00000000"  size="0x8000"                   default="1"/>
        <book    name="Documents\SN32F760_V1.0R_UM.pdf"                     title="SN32F760/750/740/730 Series User Manual"/>
        <feature type="IOs"           n="42"/>
        <feature type="ADC"           n="8"       m="12"/>
        <feature type="LCD"           n="18"      m="4"/>
        <feature type="QFP"           n="48"/>
      </device>
      
      <!-- *************************  Device 'SN32F758F'  ***************************** -->
      <device Dname="SN32F758F">
        <processor Dclock="50000000"/>
        <compile header="Device\Include\SN32F760.h"  define="SN32F750"/>
        <debug      svd="SVD\SN32F760.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x8000"     startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x1000"     init   ="0"   default="1"/>
        <algorithm  name="Flash\SN32F750_32.FLM"    start="0x00000000"  size="0x8000"                   default="1"/>
        <book    name="Documents\SN32F760_V1.0R_UM.pdf"                     title="SN32F760/750/740/730 Series User Manual"/>
        <feature type="IOs"           n="57"/>
        <feature type="ADC"           n="11"      m="12"/>
        <feature type="LCD"           n="28"      m="4"/>
        <feature type="QFP"           n="64"/>
      </device>
      
      <!-- *************************  Device 'SN32F759F'  ***************************** -->
      <device Dname="SN32F759F">
        <processor Dclock="50000000"/>
        <compile header="Device\Include\SN32F760.h"  define="SN32F750"/>
        <debug      svd="SVD\SN32F760.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x8000"     startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x1000"     init   ="0"   default="1"/>
        <algorithm  name="Flash\SN32F750_32.FLM"    start="0x00000000"  size="0x8000"                   default="1"/>
        <book    name="Documents\SN32F760_V1.0R_UM.pdf"                     title="SN32F760/750/740/730 Series User Manual"/>
        <feature type="IOs"           n="64"/>
        <feature type="ADC"           n="14"      m="12"/>
        <feature type="LCD"           n="32"      m="4"/>
        <feature type="QFP"           n="80"/>
      </device>
      </subFamily>

      <!-- ************************  Subfamily 'SN32F760'  **************************** -->
      <subFamily DsubFamily="SN32F760">
        <feature type="Timer"         n="3"       m="16"/>
        <feature type="Timer"         n="3"       m="32"/>
        <feature type="PWM"           n="21"/>
      
      <!-- *************************  Device 'SN32F765J'  ***************************** -->
      <device Dname="SN32F765J">
        <processor Dclock="50000000"/>
        <compile header="Device\Include\SN32F760.h"  define="SN32F760"/>
        <debug      svd="SVD\SN32F760.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x10000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x2000"     init   ="0"   default="1"/>
        <algorithm  name="Flash\SN32F760_64.FLM"    start="0x00000000"  size="0x10000"                  default="1"/>
        <book    name="Documents\SN32F760_V1.0R_UM.pdf"                     title="SN32F760/750/740/730 Series User Manual"/>
        <feature type="IOs"           n="26"/>
        <feature type="ADC"           n="4"       m="12"/>
        <feature type="QFN"           n="33"/>
      </device>
      
      <!-- *************************  Device 'SN32F766J'  ***************************** -->
      <device Dname="SN32F766J">
        <processor Dclock="50000000"/>
        <compile header="Device\Include\SN32F760.h"  define="SN32F760"/>
        <debug      svd="SVD\SN32F760.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x10000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x2000"     init   ="0"   default="1"/>
        <algorithm  name="Flash\SN32F760_64.FLM"    start="0x00000000"  size="0x10000"                  default="1"/>
        <book    name="Documents\SN32F760_V1.0R_UM.pdf"                     title="SN32F760/750/740/730 Series User Manual"/>
        <feature type="IOs"           n="40"/>
        <feature type="ADC"           n="7"       m="12"/>
        <feature type="LCD"           n="17"      m="4"/>
        <feature type="QFN"           n="46"/>
      </device>
      
      <!-- *************************  Device 'SN32F767F'  ***************************** -->
      <device Dname="SN32F767F">
        <processor Dclock="50000000"/>
        <compile header="Device\Include\SN32F760.h"  define="SN32F760"/>
        <debug      svd="SVD\SN32F760.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x10000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x2000"     init   ="0"   default="1"/>
        <algorithm  name="Flash\SN32F760_64.FLM"    start="0x00000000"  size="0x10000"                  default="1"/>
        <book    name="Documents\SN32F760_V1.0R_UM.pdf"                     title="SN32F760/750/740/730 Series User Manual"/>
        <feature type="IOs"           n="42"/>
        <feature type="ADC"           n="8"       m="12"/>
        <feature type="LCD"           n="18"      m="4"/>
        <feature type="QFP"           n="48"/>
      </device>
      
      <!-- *************************  Device 'SN32F768F'  ***************************** -->
      <device Dname="SN32F768F">
        <processor Dclock="50000000"/>
        <compile header="Device\Include\SN32F760.h"  define="SN32F760"/>
        <debug      svd="SVD\SN32F760.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x10000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x2000"     init   ="0"   default="1"/>
        <algorithm  name="Flash\SN32F760_64.FLM"    start="0x00000000"  size="0x10000"                  default="1"/>
        <book    name="Documents\SN32F760_V1.0R_UM.pdf"                     title="SN32F760/750/740/730 Series User Manual"/>
        <feature type="IOs"           n="57"/>
        <feature type="ADC"           n="11"      m="12"/>
        <feature type="LCD"           n="28"      m="4"/>
        <feature type="QFP"           n="64"/>
      </device>
      
      <!-- *************************  Device 'SN32F769F'  ***************************** -->
      <device Dname="SN32F769F">
        <processor Dclock="50000000"/>
        <compile header="Device\Include\SN32F760.h"  define="SN32F760"/>
        <debug      svd="SVD\SN32F760.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x10000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x2000"     init   ="0"   default="1"/>
        <algorithm  name="Flash\SN32F760_64.FLM"    start="0x00000000"  size="0x10000"                  default="1"/>
        <book    name="Documents\SN32F760_V1.0R_UM.pdf"                     title="SN32F760/750/740/730 Series User Manual"/>
        <feature type="IOs"           n="64"/>
        <feature type="ADC"           n="14"      m="12"/>
        <feature type="LCD"           n="32"      m="4"/>
        <feature type="QFP"           n="80"/>
      </device>
      </subFamily>

    </family>
  </devices>

  <conditions>
    <!-- conditions are dependecy rules that can apply to a component or an individual file -->
    <condition id="Compiler ARM">
      <!-- conditions selecting ARM Compiler -->
      <require Tcompiler="ARMCC"/>
    </condition>

    <condition id="SN32F7">
      <description>SONiX SN32F7 Series devices</description>
      <require Dname="SN32F7*"/>
    </condition>

    <condition id="SN32F70">
      <description>SONiX SN32F700 Series devices</description>
      <require Dname="SN32F70*"/>
    </condition>
    <condition id="SN32F71">
      <description>SONiX SN32F710 Series devices</description>
      <require Dname="SN32F71*"/>
    </condition>
    <condition id="SN32F72">
      <description>SONiX SN32F720 Series devices</description>
      <require Dname="SN32F72*"/>
    </condition>
