XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/Keil.SN32F7_DFP.pdsc
    <condition id="SN32F73">
      <description>SONiX SN32F730 Series devices</description>
      <require Dname="SN32F73*"/>
    </condition>
    <condition id="SN32F74">
      <description>SONiX SN32F740 Series devices</description>
      <require Dname="SN32F74*"/>
    </condition>
    <condition id="SN32F75">
      <description>SONiX SN32F750 Series devices</description>
      <require Dname="SN32F75*"/>
    </condition>
    <condition id="SN32F76">
      <description>SONiX SN32F760 Series devices</description>
      <require Dname="SN32F76*"/>
    </condition>
    <condition id="SN32F73_4_5_6">
      <description>SONiX SN32F730/40/50/60 Series devices</description>
      <accept condition="SN32F73"/>
      <accept condition="SN32F74"/>
      <accept condition="SN32F75"/>
      <accept condition="SN32F76"/>
    </condition>

    <condition id="SN32F7 CMSIS Device">
      <!-- conditions selecting Devices -->
      <description>SONiX SN32F7 Series devices and CMSIS-CORE</description>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Dvendor="SONiX:110" Dname="SN32F7*"/>
    </condition>

  </conditions>

  <boards>
    <board vendor="SONiX" name="SN32F760 Starter Kit" revision="v1.1" salesContact="sales@sonix.com.tw" orderForm="http://www.sonix.com.tw/sonix/product.do?p=SN32F706">
      <description>SONiX SN32F760 Starter Kit</description>
      <book category="schematic" name="Documents\SN32F760_STARTKIT_V1.1.pdf" title="Schematics"/>
      <mountedDevice    deviceIndex="0" Dvendor="SONiX:110" Dname="SN32F769"/>
      <compatibleDevice deviceIndex="0" Dvendor="SONiX:110" Dfamily="SN32F760"/>
      <feature type="PWR"       n="5"              name="USB Powered"/>
      <feature type="Button"    n="3"              name="Push-buttons: User and Reset"/>
      <feature type="USB"       n="1"              name="USB device with USB Standard-B Connector"/>
      <feature type="RS232"     n="1"              name="DB9 Female Connector"/>
      <feature type="DIO"       n="41"             name="Digital IOs (shared with Analog IOs)"/>
      <feature type="LED"       n="2"              name="LEDs: One user, one PWR LED"/>
      <feature type="ConnOther" n="1"              name="JTAG Interface"/>
    </board>
  </boards>

  <examples>
    <example name="CMSIS-RTOS Blinky" doc="Abstract.txt" folder="Boards\SONiX\SN32F760 Starter Kit Rev1_1\RTX_Blinky">
      <description>CMSIS-RTOS based Blinky example</description>
      <board name="SN32F760 Starter Kit Rev1_1" vendor="SONiX" Dvendor="SONiX:110" Dname="SN32F769"/>
      <project>
        <environment name="uv" load="Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="CMSIS" Cgroup="RTOS"/>
        <category>Getting Started</category>
        <category>CMSIS-RTX</category>
      </attributes>
    </example>
  </examples>


  <components>
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="SN32F7 CMSIS Device">
      <!-- Cversion is necessary -->
      <description>System Startup for SONiX SN32F7 Series</description>
      <RTE_Components_h>
        <!-- the following content goes into file 'RTE_Components.h' -->
      </RTE_Components_h>

      <files>
        <!--  include folder -->
        <file category="include" name="Device\Include\"/>
              
        <!-- startup files -->
        <file category="source" name="Device\Source\ARM\startup_SN32F700.s"   attr="config"    condition="SN32F70"/>
        <file category="source" name="Device\Source\ARM\startup_SN32F710.s"   attr="config"    condition="SN32F71"/>
        <file category="source" name="Device\Source\ARM\startup_SN32F720.s"   attr="config"    condition="SN32F72"/>
        <file category="source" name="Device\Source\ARM\startup_SN32F760.s"   attr="config"    condition="SN32F73_4_5_6"/>

        <!-- system file -->
        <file category="source" name="Device\Source\system_SN32F700.c"        attr="config"    condition="SN32F70"/>
        <file category="source" name="Device\Source\system_SN32F710.c"        attr="config"    condition="SN32F71"/>
        <file category="source" name="Device\Source\system_SN32F720.c"        attr="config"    condition="SN32F72"/>
        <file category="source" name="Device\Source\system_SN32F760.c"        attr="config"    condition="SN32F73_4_5_6"/>

      </files>
    </component>
    
  </components>
</package>
